InformationRegisters/ПолисыОМСФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПолисыОМСФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерПолиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ПолисыОМС/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает таблицу заполненную номерами ОМС и сроками их действия для физических лиц.
//
// Параметры:
//  СписокФизическихЛиц - Массив ссылок на элементы справочника физические лица или
//						  СправочникСсылка.ФизическиеЛица.
//	ДатаСведений		- дата на которую необходимо получить номера полисов ОМС физических лиц,
//						если дату не указывать, данные будут получены на текущую дату.
//
// Возвращаемое значение:
//	ТаблицаЗначений - Таблица значений, содержащая поля:
//		* ФизическоеЛицо	- СправочникСсылка.ФизическиеЛица
//		* НомерПолиса		- Строка
//		* ДатаОкончания		- Дата
//
Функция НомераОМС(СписокФизическихЛиц, ДатаСведений = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСведений", ?(ДатаСведений = Неопределено, ТекущаяДатаСеанса(),ДатаСведений));
	Запрос.УстановитьПараметр("СписокФизическихЛиц", СписокФизическихЛиц);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолисыОМСФизическихЛицСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПолисыОМСФизическихЛицСрезПоследних.НомерПолиса КАК НомерПолиса,
		|	ПолисыОМСФизическихЛицСрезПоследних.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.ПолисыОМСФизическихЛиц.СрезПоследних(&ДатаСведений, ФизическоеЛицо.Ссылка В (&СписокФизическихЛиц)) КАК ПолисыОМСФизическихЛицСрезПоследних";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ФизическиеЛицаПриСозданииНаСервере(Форма, ИмяГруппы) Экспорт
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПолисыОМСФизическихЛиц) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьРеквизитыСведенийДляРеестра(Форма);
	
	ДобавитьКомандуРедактированияСведенийДляРеестраГосслужащих(Форма, ИмяГруппы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьРеквизитыСведенийДляРеестра(Форма)
	
	МассивИменРеквизитовФормы = Новый Массив;
	ДобавляемыеРеквизиты = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПолисыОМСФизическихЛиц", Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.ПолисыОМСФизическихЛиц")));
	
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
	
КонецПроцедуры

Процедура ДобавитьКомандуРедактированияСведенийДляРеестраГосслужащих(Форма, ИмяГруппы)
	
	ИмяКоманды = "РедактированиеСведенийДляРеестраГосслужащих";
	
	Команда = Форма.Команды.Добавить(ИмяКоманды);
	Команда.Заголовок = НСтр("ru = 'Полисы ОМС'");
	Команда.Действие = "Подключаемый_ПолисыОМС";
	
	Группа = Форма.Элементы.Найти(ИмяГруппы);
		   
	Кнопка = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Группа);
	Кнопка.Вид = ВидКнопкиФормы.Гиперссылка;
	Кнопка.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.РегистрыСведений.ПолисыОМСФизическихЛиц, Истина);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|РегистрСведений.ПолисыОМСФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПолисыОМСФизическихЛиц.Изменение.ГруппыФизическихЛиц";
	
КонецПроцедуры

#КонецОбласти

#Область КадровыеДанныеСотрудников

Функция ЗапросВТСведенияОПолисахОМС(ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, ПоляОтбораПериодическихДанных, ИмяВТОПолисахОМС = "ВТСведенияОПолисахОМС")
	
	ПоляОтбора = Неопределено;
	Если ПоляОтбораПериодическихДанных <> Неопределено Тогда
		ПоляОтбораПериодическихДанных.Свойство("ПолисыОМСФизическихЛиц", ПоляОтбора);
	КонецЕсли;
	
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
		ОписательВременнойТаблицыОтборов.ИмяВременнойТаблицыОтборовФизическихЛиц, "ФизическоеЛицо");
	
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("Период", ОписательВременнойТаблицыОтборов.ИмяПоляПериод);
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("ФизическоеЛицо", ОписательВременнойТаблицыОтборов.ИмяПоляФизическоеЛицо);
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроения.Отборы = ПоляОтбора;
	
	ЗапросВТИмяРегистраСрез = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(
		"ПолисыОМСФизическихЛиц", 
		ТолькоРазрешенные,
		ОписаниеФильтра,
		ПараметрыПостроения,
		Истина,
		ИмяВТОПолисахОМС);
	
	Возврат ЗапросВТИмяРегистраСрез;
	
КонецФункции

Функция ДобавитьПолеСведенийОПолисахОМС(Знач ИмяПоля, ТекстыОписанияПолей, ИсточникиДанных) Экспорт
	
	ДобавленоПолеСведений = Ложь;
	Если НеобходимыСведенияОПолисахОМС(ИмяПоля) Тогда
		
		ДобавленоПолеСведений = Истина;
		ИсточникиДанных.Вставить("СведенияОПолисахОМС", Истина);
		
		ПутьКДанным = ПутьКДаннымСведенийОПолисахОМС(ИмяПоля);
		ТекстыОписанияПолей.Добавить(ПутьКДанным + " КАК " + ИмяПоля);
		
	КонецЕсли;
	
	Возврат ДобавленоПолеСведений;
	
КонецФункции

Функция НеобходимыСведенияОПолисахОМС(Знач ИмяПоля) Экспорт
	
	ИмяПоля = ВРег(ИмяПоля);
	
	Возврат ИмяПоля = ВРег("НомерПолисаОМС")
		Или ИмяПоля = ВРег("ДатаОкончанияПолисаОМС");
		
КонецФункции

Функция ПутьКДаннымСведенийОПолисахОМС(Знач ИмяПоля)
	
	ИмяПоляВВерхнемРегистре = ВРег(ИмяПоля);
	
	ПутьКДанным = "";
	
	Если ИмяПоляВВерхнемРегистре = ВРег("НомерПолисаОМС") Тогда
		ПутьКДанным = "СведенияОПолисахОМС.НомерПолиса";
	ИначеЕсли ИмяПоляВВерхнемРегистре = ВРег("ДатаОкончанияПолисаОМС") Тогда
		ПутьКДанным = "СведенияОПолисахОМС.ДатаОкончания";
	КонецЕсли;
	
	Возврат ПутьКДанным;
	
КонецФункции

Процедура ДобавитьТекстЗапросаВТСведенияОПолисахОМС(Запрос, ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, ПоляОтбораПериодическихДанных, ИсточникиДанных) Экспорт
	
	НеобходимыеСведения = ИсточникиДанных.Получить("СведенияОПолисахОМС");
	Если НеобходимыеСведения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросВТ = ЗапросВТСведенияОПолисахОМС(ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, ПоляОтбораПериодическихДанных);
	
	ЗарплатаКадрыОбщиеНаборыДанных.СкопироватьПараметрыЗапроса(Запрос, ЗапросВТ);
	
	ЧастиЗапроса = Новый Массив;
	ЧастиЗапроса.Добавить(ЗапросВТ.Текст);
	ЧастиЗапроса.Добавить(ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов());
	ЧастиЗапроса.Добавить(Запрос.Текст);
	
	ЧастиЗапроса.Добавить(
		"	{ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОПолисахОМС КАК СведенияОПолисахОМС
		|	ПО ТаблицаОтборов." + ОписательВременнойТаблицыОтборов.ИмяПоляФизическоеЛицо + " = СведенияОПолисахОМС.ФизическоеЛицо
		|		И ТаблицаОтборов." + ОписательВременнойТаблицыОтборов.ИмяПоляПериод + " = СведенияОПолисахОМС.Период}");
	
	Запрос.Текст = СтрСоединить(ЧастиЗапроса, Символы.ПС);
	
	КадровыйУчет.ДобавитьВКоллекциюИмяКадровыхДанных(ИсточникиДанных, "ВТКУничтожению", "ВТСведенияОПолисахОМС");
	
КонецПроцедуры

Процедура ЗаполнитьПоляПредставленийКадровыхДанныхФизическихЛиц(ДополнительныеПоляПредставлений, ПутьКПолямЛичныхДанных, ИсключаемыеПоля) Экспорт
	
	ОписаниеПоля = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеДополнительногоПоляПредставлений();
	ОписаниеПоля.ИмяПоля = "НомерПолисаОМС";
	ОписаниеПоля.ПустоеЗначениеНаЯзыкеЗапросов = """""";
	ОписаниеПоля.ЗаголовокПоляСКД = НСтр("ru='Номер полиса ОМС'");
	ОписаниеПоля.ПутьПоляСКД = ПутьКПолямЛичныхДанных + ".НомерПолисаОМС";
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьПолеПредставления(ДополнительныеПоляПредставлений, ОписаниеПоля, ИсключаемыеПоля);
	
	ОписаниеПоля = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеДополнительногоПоляПредставлений();
	ОписаниеПоля.ИмяПоля = "ДатаОкончанияПолисаОМС";
	ОписаниеПоля.ПустоеЗначениеНаЯзыкеЗапросов = "ДАТАВРЕМЯ(1, 1, 1)";
	ОписаниеПоля.ЗаголовокПоляСКД = НСтр("ru='Дата окончания полиса ОМС'");
	ОписаниеПоля.ПутьПоляСКД = ПутьКПолямЛичныхДанных + ".ДатаОкончанияПолисаОМС";
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьПолеПредставления(ДополнительныеПоляПредставлений, ОписаниеПоля, ИсключаемыеПоля);
		
КонецПроцедуры

#КонецОбласти
